#include "stm32f10x.h"
#include "timingconfig.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
//********************************************************************************
//Function: настройкa системы тактирования контроллера STM32F100xx              //
//          источник сигнала - HSE генератор с кварцем 8MHz через PLL           //
//return:   0 - ok; 1 - генератор HSE не запустился                             //
//********************************************************************************
unsigned char InitClk()
{
  unsigned long int TimeOut = 10000;

  //Запустить HSE
  RCC->CR   |=  RCC_CR_HSEON;            //Включить генератор HSE
  while((RCC->CR & RCC_CR_HSERDY)==0)    //Ожидание готовности HSE
  if(TimeOut) TimeOut--;
  if(TimeOut==0) return 1;               //Ошибка!!! Генератор HSE не запустился
  RCC->CR   |=  RCC_CR_CSSON;            //Разрешить работу системы защиты сбоя HSE

  //Настройка делителя HSI
  RCC->CFGR2 &= ~RCC_CFGR2_PREDIV1;      //Предочистка делителя HSE
  RCC->CFGR2 |=  RCC_CFGR2_PREDIV1_DIV1; // Делить частоту HSE на 1

  //Настройка PLL
  RCC->CFGR  |= RCC_CFGR_PLLSRC;         //Источником сигнала для PLL выбран HSE
  RCC->CR   &= ~RCC_CR_PLLON;            //Отключить генератор PLL
  RCC->CFGR &= ~RCC_CFGR_PLLMULL;        //Очистить PLLMULL
  RCC->CFGR |=  RCC_CFGR_PLLMULL2;       //Коефициент умножения = 2
  RCC->CR   |=  RCC_CR_PLLON;            //Включить генератор PLL
  while((RCC->CR & RCC_CR_PLLRDY)==0) {} //Ожидание готовности PLL

  //Переключиться на тактирование от PLL
  RCC->CFGR &= ~RCC_CFGR_SW;             //Очистка битов выбора источника тактового сигнала
  RCC->CFGR |=  RCC_CFGR_SW_PLL;         //Выбрать источником тактового сигнала PLL
  while((RCC->CFGR&RCC_CFGR_SWS)!=0x08){}//Ожидание переключения на PLL

  return 0;                              //Все ok, работаем от HSE
}

//********************************************************************************
//Function: обработчик прерывания при сбое генератора HSE                       //
//********************************************************************************
void NMI_Handler(void)
{
  //Сбросить флаг системы контроля сбоя HSE
  if (RCC->CIR & RCC_CIR_CSSF) RCC->CIR |= RCC_CIR_CSSC;

  //Если контроллер здесь, значит HSE не работает
  //Что-то можно предпринять: перезапустить генератор, дать сигнал аврии и т.п.
}
//********************************************************************************
