#include "stm32f10x.h"
#include "MainTimer.h"
unsigned int wait=0;
void delay_ms(unsigned int mc);
//***************************************************************************
//function инициализация основного таймера                                 //
//***************************************************************************
void Timer2_Init(void)
{
  RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;    //подаем тактирование на TIM6
  TIM2->PSC	    = 2400-1;                //настроить делитель для формирования
  TIM2->ARR     = 10;                    //миллисекунд
  TIM2->DIER    = TIM_DIER_UIE;        	 //разрешить событие от таймера
  //разрешить перезагрузку и включить таймер
  TIM2->CR1     = TIM_CR1_CEN | TIM_CR1_ARPE;
  //разрешить прерывания от таймера
  NVIC_EnableIRQ (TIM2_IRQn);

}
//***************************************************************************
//function обработка прерывания от TIM3                                    //
//***************************************************************************
void TIM2_IRQHandler(void)
{static char tmp=0;

  if(TIM2->SR & TIM_SR_UIF)
  {
    TIM2->SR &= ~TIM_SR_UIF;     //сбросить флаг
    //обслужить ф-ю delay;
    if(wait) wait--;
   // if(tmp) tmp--;else{ disk_timerproc();tmp=10;}
  }
}
//***************************************************************************
//function задержка в миллисекундах                                        //
//***************************************************************************
void delay_ms(unsigned int mc)
{
  wait = mc;
  while(wait){};
}
