#include "stm32f10x.h"
char buff[128];
char ready=0;
char cnt,start=0;
//********************************************************************************
//Function: инициализация модуля USART1                                         //
//          9600 бод; 8 бит данных; 2 стоп-бита                                 //
//********************************************************************************
void USART1_Init(void)
{
  //Включение тактирования
  RCC->APB2ENR |=   RCC_APB2ENR_IOPAEN;                //Тактирование GPIO
  RCC->APB2ENR |=   RCC_APB2ENR_AFIOEN;                //Тактирование альтернативных функций GPIO
  RCC->APB2ENR |=   RCC_APB2ENR_USART1EN;              //Тактирование USART1
  //Конфигурирование PORTA.9 для TX; PORTA.10 для RX
  GPIOA->CRH   &= ~(GPIO_CRH_MODE9 | GPIO_CRH_CNF9);   //Предочистка MODE и CNF
  GPIOA->CRH   |=   GPIO_CRH_MODE9 | GPIO_CRH_CNF9_1;  //Двухтактный выход с альтернативной ф-ей, 50MHz
  GPIOA->CRH   &= ~(GPIO_CRH_MODE10 | GPIO_CRH_CNF10); //Предочистка MODE и CNF
  GPIOA->CRH   |=   GPIO_CRH_CNF10_0;                  //Вход, третье состояние
  //Задание режима работы
  USART1->BRR   =   0x09C4;                            //Cкорость обмена 9600 бод
  USART1->CR1  &=  ~USART_CR1_M;                       //8 бит данных
  USART1->CR2  &=  ~USART_CR2_STOP;                    //Предочистка числа стоп-битов
  USART1->CR2  |=   USART_CR2_STOP_0;                  //Количество стоп-битов: 2
  //Управление работой
  USART1->CR1  |=   USART_CR1_UE;                      //Включение модуля USART1
  USART1->CR1  |=   USART_CR1_TE;                      //Включение передатчика
  USART1->CR1  |=   USART_CR1_RE;                      //Отключить приемник
  //Разрешить прерывания
  NVIC_EnableIRQ (USART1_IRQn);                        //Прерывания USART1
  USART1->CR1  |= USART_CR1_RXNEIE;                    //Прерывание по завершении приема
}

//********************************************************************************
//Function: USART1 - передача байта                                             //
//Argument: передаваемый байт                                                   //
//********************************************************************************
void USART1_SendData(unsigned char data)
{
  USART1->DR  =  data;                                //запустить процесс передачи
  while((USART1->SR & USART_SR_TC)==0) {}             //ожидание передачи байта
  USART1->SR &=  ~USART_SR_TC;                        //очистить флаг
}
//********************************************************************************
//Function: Прерывание, генерируемое USART1                                     //
//********************************************************************************
void USART1_IRQHandler(void)
{
  unsigned char tmp;                                  //для временного хранения

  //Если причина прерывания окончание приема байта
  if((USART1->SR & USART_SR_RXNE)!=0)
  {
    tmp = USART1->DR;                                 //прочитать принятый байт
    if(tmp=='?') { USART1->DR='$';   return; }          //проверка связи
    if(tmp=='{') { start=1; cnt=0;   return; }          //начало строки
    if(tmp=='}')
    { start=0; ready=1;  buff[cnt] = 0;return; }          //начало строки
    buff[cnt++] = tmp;
  }
}
//********************************************************************************
